/*
	现代汉语里一般的句子成分有八种，即主语、谓语、动语、宾语、定语、状语、补语。
		主语(subject)(=):主语是句子陈述或说明的对象，说明是谁或什么。表示句子说的是"什么人"或“什么事”。主语是执行句子的行为或动作的主体;
			特点：A、经常由名词、代词、名词性短语充当。B、一般表示谓语所说的是“谁”或 “什么”。
		谓语(predicate)(_):用来说明陈述主语。能回答主语“怎么样”或“是什么”等问题，一般放在主语的后面;
			特点：A、经常由动词、形容词充当。B、一般表示主语“怎么样”或“是什么”。
		动语(passive_voice):动语和宾语是共存的两个成分，没有宾语，就无所谓动语，动语又决定宾语的性质。动语由动词性词语构成;
			特点：
		宾语(predicate)(~)：表示谓语动词的涉及对象的语言单位。宾语 往往表示动作支配的对象，并且总是处在动词的后头。可由名词、代词、数词、名词化的形容词、不定式、动名词、宾语从句等来担任；
			特点：A、经常由名词、代词、名词性短语充当。B、一般表示谓语“怎么样”或“是什么”。
		定语(attribute)：主要由形容词构成;
			特点：
		状语(adverbial_modifier)：主要由副词构成；
			特点：
		补语(accusative)：主要由谓词性词语（谓词包括动词和形容词）、数量短语和介词短语充当；
			特点：
		中心语(central_word):;
			特点：
		独立语(independent):;
			特点：

	句子构成
		常用语句： 
*/

class ch {
	constructor() {

	}
}

export { ch }